artillery/private-advanced-order.yml
config:
  target: "https://api-{{ $processEnvironment.DEPLOYING_COLOR }}.{{ $processEnvironment.EFCMS_DOMAIN }}"
  plugins:
    metrics-by-endpoint: 
      useOnlyRequestNames: true
  phases:
    - duration: 300
      arrivalCount: 50
      name: Sustained load
  payload:
    - path: "keywords.csv"
      fields:
        - "keyword"
    - path: "tokens.csv"
      fields:
        - "token"

scenarios:
  - name: "Advanced Order Search"
    flow:
      - get:
          url: "/case-documents/order-search?keyword={{ keyword }}"
          name: 'advanced-order-search'
          headers:
            Authorization: 'Bearer {{ token }}'