artillery/private-app.yml
config:
  target: "https://api-{{ $processEnvironment.DEPLOYING_COLOR }}.{{ $processEnvironment.EFCMS_DOMAIN }}"
  plugins:
    metrics-by-endpoint: 
      useOnlyRequestNames: true
  phases:
    - duration: 300
      arrivalRate: 150
      name: Sustained load

scenarios:
  - name: "Case Deadlines"
    flow:
      - get:
          url: "/case-deadlines/3325-15"
          name: 'case-deadlines'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Case Deadline Search"
    flow:
      - get:
          url: "/case-deadlines?endDate=2021-08-02T03:59:59.999Z&from=0&judge=&pageSize=100&startDate=2010-08-01T04:00:00.000Z"
          name: 'case-deadline-search'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Case Advanced Search"
    flow:
      - get:
          url: "/cases/search?countryType=domestic&petitionerName=guy&petitionerState=CA&yearFiledMin=1990&yearFiledMax=2021"
          name: 'case-advanced-search'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Blocked Cases Report"
    flow:
      - get:
          url: "/reports/blocked/Los%20Angeles,%20California"
          name: 'blocked-cases-report'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Case Inventory Report"
    flow:
      - get:
          url: "/reports/case-inventory-report?associatedJudge=Carluzzo&from=0&pageSize=25&status="
          name: 'case-inventory-report'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Pending Items"
    flow:
      - get:
          url: "/reports/pending-items?judge=Buch&page=0"
          name: 'pending-items'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Messages: User Inbox"
    flow:
      - get:
          url: "/messages/inbox/8867788e-cc3b-462b-bf7c-f55c127af2ca"
          name: 'messages-user-inbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Messages: Completed Section (Docket)"
    flow:
      - get:
          url: "/messages/completed/section/docket"
          name: 'messages-section-docket-inbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Messages: Sent Section (Docket)"
    flow:
      - get:
          url: "/messages/outbox/section/docket"
          name: 'messages-section-docket-sent'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Messages: User Completed"
    flow:
      - get:
          url: "/messages/completed/8867788e-cc3b-462b-bf7c-f55c127af2ca"
          name: 'messages-user-completed'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Messages: User Sent"
    flow:
      - get:
          url: "/messages/outbox/8867788e-cc3b-462b-bf7c-f55c127af2ca"
          name: 'messages-user-sent'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Practitioner By Name"
    flow:
      - get:
          url: "/practitioners?name=test"
          name: 'practitioner-by-name'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Document QC: User Inbox"
    flow:
      - get:
          url: "/users/8867788e-cc3b-462b-bf7c-f55c127af2ca/document-qc/inbox"
          name: 'document-qc-user-inbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Document QC: User Outbox"
    flow:
      - get:
          url: "/users/8867788e-cc3b-462b-bf7c-f55c127af2ca/document-qc/served"
          name: 'document-qc-user-outbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Document QC: User Outbox"
    flow:
      - get:
          url: "/users/8867788e-cc3b-462b-bf7c-f55c127af2ca/document-qc/served"
          name: 'document-qc-user-outbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Document QC: Section Inbox (Docket)"
    flow:
      - get:
          url: "/sections/docket/document-qc/inbox"
          name: 'document-qc-section-inbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'
  - name: "Document QC: Section Outbox (Docket)"
    flow:
      - get:
          url: "/sections/docket/document-qc/served"
          name: 'document-qc-section-outbox'
          headers:
            Authorization: 'Bearer {{ $processEnvironment.AUTH_TOKEN }}'