artillery/read-messages.yml
config:
  target: "https://api-{{ $processEnvironment.DEPLOYING_COLOR }}.{{ $processEnvironment.EFCMS_DOMAIN }}"
  plugins:
    metrics-by-endpoint: 
      useOnlyRequestNames: true
  phases:
    - duration: 180
      arrivalCount: 1800
      name: Sustained load
  payload:
    - path: "token-ids.csv"
      fields:
        - "token"
        - "userId"

scenarios:
  - name: "Checking Inbox"
    flow:
      - get:
          url: "/messages/inbox/{{userId}}"
          name: 'load message inbox'
          headers:
            Authorization: 'Bearer {{ token }}'