artillery/read-qc-section-messages.yml
config:
  target: 'https://api-{{ $processEnvironment.DEPLOYING_COLOR }}.{{ $processEnvironment.EFCMS_DOMAIN }}'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  phases:
    - duration: 60
      arrivalCount: 180
      name: Sustained load
  payload:
    - path: 'tokens.csv'
      fields:
        - 'token'

scenarios:
  - name: 'Checking Section Inbox'
    flow:
      - get:
          url: '/sections/petitions/document-qc/inbox'
          name: 'load section document-qc inbox'
          headers:
            Authorization: 'Bearer {{ token }}'